app/controllers/books_controller.rb

SELECT "books".* FROM "books" ORDER BY published desc
---
  def index
    @books = Book.order(sort_column + " " + sort_direction)

INSERT INTO "books" ("title", "author", "isbn", "published", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Bible"], ["author", "God"], ["isbn", "9780007103072"], ["published", "0001-01-01"], ["created_at", "2022-08-25 15:43:13.670444"], ["updated_at", "2022-08-25 15:43:13.670444"]]
---
  def create
    @book = Book.new(book_params)

    if @book.save

UPDATE "books" SET "published" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["published", "0002-01-01"], ["updated_at", "2022-08-25 18:44:11.121790"], ["id", 1]]
---
  def update
    if @book.update(book_params)